In [2]:
import pandas as pd
import numpy as np
import random as rand

Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.
Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.

## 1. The Easy Way

In the following we will be generating our own data within the notebook. Please feel free to try these methods out with any data you may have locally saved in a csv/txt file.

In [8]:
df_dict = {'employee_name': ['spongebob', 'patrick', 'squidward', 'mr krabs', 'sandy', 'plankton'],
        'employer': ['krusty krab', 'unemployed', 'krusty krab', 'krusty krab', 'self employed', 'the chum bucket'],
        'salary': [30000, 0, 40000, 100000, 70000, 80000],
        'bonus': [5000, 0, 2500, 10000, 8500, 10000]
       }

df_1 = pd.DataFrame(df_dict)
df_1

  employee_name         employer  salary  bonus
0     spongebob      krusty krab   30000   5000
1       patrick       unemployed       0      0
2     squidward      krusty krab   40000   2500
3      mr krabs      krusty krab  100000  10000
4         sandy    self employed   70000   8500
5      plankton  the chum bucket   80000  10000

We can simply get a total compensation by adding the salary and bonus together using the following.

In [9]:
df_1['total_comp'] = df_1['salary'] + df_1['bonus']
df_1

  employee_name         employer  salary  bonus  total_comp
0     spongebob      krusty krab   30000   5000       35000
1       patrick       unemployed       0      0           0
2     squidward      krusty krab   40000   2500       42500
3      mr krabs      krusty krab  100000  10000      110000
4         sandy    self employed   70000   8500       78500
5      plankton  the chum bucket   80000  10000       90000

Now we want to count how many people work for each employer. We can create a count variable very easily using the following code.

In [10]:
df_1['count'] = 1

In [11]:
df_1[['employer','count']].groupby('employer').sum()

                 count
employer
krusty krab          3
self employed        1
the chum bucket      1
unemployed           1

## 2. List Comprehension

Here we will be using list comprehension to both generate our data set, as well as create a calculated field.

In the following, we generate 100 instances of a random BMI value ranging from 20 to 35.

In [12]:
bmi = [rand.randint(20,35) for i in range(100)]
bmi_df = pd.DataFrame(bmi)
bmi_df.columns = ['bmi']
bmi_df.head(3)

   bmi
0   33
1   30
2   34

We then flag any bmi value less than or equal to 25 to be within the normal range, and bmi values higher than 25 are classified as overweight.

In [13]:
bmi_df['bmi_range'] = ['normal range' if a<=25 else 'overweight' for a in bmi_df['bmi']]
bmi_df.head(3)

   bmi   bmi_range
0   33  overweight
1   30  overweight
2   34  overweight

Below is a summary of how many data points are classified as normal range vs overweight.

In [14]:
bmi_df.groupby('bmi_range').count()

              bmi
bmi_range
normal range   37
overweight     63

## 3. Using .loc function in Pandas

Next, we will create a calculated field using the .loc function in pandas.

In [26]:
age = [rand.randint(1,95) for i in range(100)]
age_df = pd.DataFrame(age)
age_df.columns = ['age']
age_df.head(3)

   age
0   41
1   70
2   90

.loc is an easy way for us to create a calculated field with multiple categories. For example: here we want to classify age into five different categories.

In [32]:
age_df.loc[age_df['age'].astype(float) <= 20, 'age_group'] = '0-20'
age_df.loc[age_df['age'].astype(float).between(21,40) , 'age_group'] = '21-40'
age_df.loc[age_df['age'].astype(float).between(41,60) , 'age_group'] = '41-60'
age_df.loc[age_df['age'].astype(float).between(61,80) , 'age_group'] = '61-80'
age_df.loc[age_df['age'].astype(float).between(81,1000) , 'age_group'] = '81-95'

/var/folders/lr/q19g4szs70j9_jb4plblj5x00000gn/T/ipykernel_5534/4085896801.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '0-20' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  age_df.loc[age_df['age'].astype(float) <= 20, 'age_group'] = '0-20'

In [33]:
age_df['count']=1

In [34]:
age_df.head(3)

   age  count age_group
0   41      1     41-60
1   70      1     61-80
2   90      1     81-95

The following is the summary of count per age group.

In [35]:
age_df[['age_group','count']].groupby('age_group').sum()

           count
age_group
0-20          17
21-40         27
41-60         18
61-80         18
81-95         20

## 4. NumPy .where statement

Another way of created a new field in a pandas data frame is using numpy's selection function. 

The following data displays the salary, bonus, and employee rating for each employee indicated by the employee_name.

In [4]:
df_dict = {'employee_name': ['spongebob', 'patrick', 'squidward', 'mr krabs', 'sandy', 'plankton'],
        'salary': [30000, 0, 40000, 100000, 70000, 80000],
        'bonus': [5000, 0, 2500, 10000, 8500, 10000],
        'employee_rating': [10, 0, 4, 8, 9, 7]
       }

df_2 = pd.DataFrame(df_dict)
df_2

  employee_name  salary  bonus  employee_rating
0     spongebob   30000   5000               10
1       patrick       0      0                0
2     squidward   40000   2500                4
3      mr krabs  100000  10000                8
4         sandy   70000   8500                9
5      plankton   80000  10000                7

We want to add a bonus to each employee's annual salary, for employees with an employee rating of 7 or higher. Using np.where, we assign the salary + bonus as the total_salary for when the condition is true, and only the base salary for when the condition is false.

In [6]:
df_2['total_salary'] = np.where(df_2['employee_rating'] >= 7, df_2['salary'] + df_2['bonus'], df_2['salary'])

In [7]:
df_2

  employee_name  salary  bonus  employee_rating  total_salary
0     spongebob   30000   5000               10         35000
1       patrick       0      0                0             0
2     squidward   40000   2500                4         40000
3      mr krabs  100000  10000                8        110000
4         sandy   70000   8500                9         78500
5      plankton   80000  10000                7         90000

## 5. Applying a custom function

Now we will do data cleaning, and formatting by writing a function. First, I create a function that will generate a bunch of random phone numbers in different formats.

In [42]:
area_codes = [415, 408, 510, 650]

def messy_num_generator(area_code_list):
    
    area_code = str(rand.choice(area_code_list))
    
    rand_num = rand.random() 
    if rand_num < 0.25: 
        # format: (###)###-####
        num_1 = str(rand.randint(100, 999))
        num_2 = str(rand.randint(1000, 9999))
        num_str = '(' + area_code + ')' + num_1 + '-' + num_2
    
    elif rand_num >= 0.25 and rand_num <0.5: 
        #format: ##########
        num_1 = str(rand.randint(100, 999))
        num_2 = str(rand.randint(1000, 9999))
        num_str = area_code + num_1 + num_2
        
    elif rand_num >= 0.5 and rand_num <0.75:     
        #format: ###-###-####
        num_1 = str(rand.randint(100, 999))
        num_2 = str(rand.randint(1000, 9999))
        num_str = area_code + '-' + num_1 + '-' + num_2

    else:
        #format: ### ### ####
        num_1 = str(rand.randint(100, 999))
        num_2 = str(rand.randint(1000, 9999))
        num_str = area_code + ' ' + num_1 + ' ' + num_2
    
    return num_str

In [48]:
messy_numbers = [messy_num_generator(area_codes) for i in range(100)]
messy_numbers_df = pd.DataFrame(messy_numbers)
messy_numbers_df.columns = ['messy_num']
messy_numbers_df

        messy_num
0      6507966513
1      5108971505
2   (408)523-4240
3    510 952 7675
4      6502611045
..            ...
95  (408)503-5373
96     4087654199
97   510-519-2848
98     5108911027
99  (650)811-9678

[100 rows x 1 columns]

In [55]:
def get_raw_number(phone_number):
    return ''.join(d for d in phone_number if d.isdigit())

In [56]:
messy_numbers_df['raw_num'] = messy_numbers_df['messy_num'].apply(get_raw_number)

In [57]:
messy_numbers_df

        messy_num     raw_num
0      6507966513  6507966513
1      5108971505  5108971505
2   (408)523-4240  4085234240
3    510 952 7675  5109527675
4      6502611045  6502611045
..            ...         ...
95  (408)503-5373  4085035373
96     4087654199  4087654199
97   510-519-2848  5105192848
98     5108911027  5108911027
99  (650)811-9678  6508119678

[100 rows x 2 columns]